{
  "backend/main.mo": "Motoko actor defining product, offer, order, and customer types with demo seeding and storage maps for products, offers, orders, and user profiles.",
  "feature_evidence.json": "Feature evidence report listing no-auth admin mode changes and related frontend file references.",
  "frontend-file-summaries.txt": "Reference file providing prewritten short summaries for many frontend files.",
  "frontend/index.css": "Tailwind base/theme definitions with OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.testing.md": "Testing guide describing Vitest and React Testing Library setup for the frontend.",
  "frontend/src/admin/AdminLayout.tsx": "Admin dashboard layout with navigation, header, unread notifications badge, and outlet content area.",
  "frontend/src/admin/adminNoAuth.ts": "Exports a flag enabling temporary admin no-auth mode and a helper to read it.",
  "frontend/src/admin/components/AdminAccessNotInitialized.tsx": "UI card shown when admin access is not initialized, with instructions and a link back to shop.",
  "frontend/src/admin/components/AdminGuard.tsx": "Protects admin routes by checking identity and admin status, handling redirects and loading states with optional no-auth mode.",
  "frontend/src/admin/components/AdminUserMenu.tsx": "Displays an admin user dropdown with a logout option that clears identity and query cache before navigating home.",
  "frontend/src/admin/notifications/useOrderNotifications.ts": "Tracks new orders since last seen using localStorage and exposes notifications, unread count, and a mark-all-read function.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Handles admin login flow with Internet Identity, admin validation, redirects, and a special no-auth mode UI.",
  "frontend/src/admin/pages/CustomerDetailPage.tsx": "Shows detailed customer info and order history with navigation and loading/error handling.",
  "frontend/src/admin/pages/CustomersListPage.tsx": "Lists all customers with search, summary stats, and navigation to individual customer pages.",
  "frontend/src/admin/pages/NotificationsFeedPage.tsx": "Displays order notifications feed with unread count and ability to mark all notifications as read.",
  "frontend/src/admin/pages/OffersManagementPage.tsx": "Admin page for listing, creating, editing, activating, deactivating, and deleting offers with banner upload support.",
  "frontend/src/admin/pages/OrdersDashboardPage.tsx": "Displays all orders with sorting, status indicators, and controls to update order status.",
  "frontend/src/admin/pages/ProductsManagementPage.tsx": "Admin interface for managing products including creation, editing, deletion, searching, and image upload with progress.",
  "frontend/src/App.tsx": "React router configuration defining customer and admin route trees with AdminGuard and CartProvider.",
  "frontend/src/customer/cart/CartContext.tsx": "Provides cart state, item management functions, and computed totals via React context.",
  "frontend/src/customer/CustomerLayout.tsx": "Layout wrapper providing header, navigation, cart badge, footer, and content outlet for customer-facing pages.",
  "frontend/src/customer/pages/CartPage.tsx": "Displays cart items with quantity controls, pricing summary, and checkout navigation or empty-cart message.",
  "frontend/src/customer/pages/CheckoutPage.tsx": "Checkout form that collects delivery details, submits an order, and navigates to confirmation on success.",
  "frontend/src/customer/pages/OffersPage.tsx": "Displays active promotional offers with banners and dates, handling loading and empty states.",
  "frontend/src/customer/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a placed order and provides navigation back to shopping or home.",
  "frontend/src/customer/pages/ProductDetailPage.tsx": "Fetches and displays a product’s details, allows quantity selection, and adds items to the cart.",
  "frontend/src/customer/pages/ProductListPage.tsx": "Lists all products with search, loading states, and add‑to‑cart functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for admin checks, user profiles, products, offers, and order mutations using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes using custom OKLCH color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/EntryLandingPage.tsx": "Implements the landing page with hero banner, CTA to shop, features list, and footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a styled 404 page with navigation buttons back to home or shop.",
  "frontend/src/test/adminAccessFlow.test.tsx": "Empty test placeholder for admin access flow.",
  "frontend/src/test/customerHappyPath.test.tsx": "Empty test placeholder for customer happy-path flow.",
  "frontend/src/test/mocks/actorMocks.ts": "Empty file intended for backend actor mocks.",
  "frontend/src/test/renderWithProviders.tsx": "Empty helper placeholder for rendering components with providers for tests.",
  "frontend/src/test/setupTests.ts": "Empty test setup file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, animations, and enabling plugins.",
  "frontend/vitest.config.ts": "Empty Vitest configuration placeholder.",
  "project_state.json": "Metadata describing project state, feature requests, and focus on temporarily disabling admin authentication."
}