{
  "kind": "build_request",
  "title": "Temporarily disable admin authentication and admin permission checks",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Disable the admin-route authentication gate so users can access the admin portal without logging in via Internet Identity (no redirect to `/admin/login` and no admin-status check) while this temporary mode is enabled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "remove authemtication for now from amdin",
          "build it now now"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to `/admin` in a fresh browser session (no Internet Identity login) renders the Admin portal layout and dashboard pages instead of redirecting to `/admin/login`.",
        "Admin routes under `/admin/*` remain reachable without an identity present (e.g., `/admin/products`, `/admin/offers`, `/admin/customers`, `/admin/notifications`).",
        "No UI state is blocked by AdminGuard loading/redirect states when identity is absent."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the admin login page behavior for the temporary no-auth mode so it does not prompt for Internet Identity login; instead it should provide a simple message that admin authentication is currently disabled and a button/link to enter the admin portal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "remove authemtication for now from amdin"
        ]
      },
      "acceptanceCriteria": [
        "Visiting `/admin/login` does not require Internet Identity login in the temporary no-auth mode.",
        "The page displays clear English text indicating admin authentication is temporarily disabled and provides a working action to navigate to `/admin`."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Temporarily disable backend admin permission enforcement for all admin-only endpoints so that admin UI operations (orders dashboard, order status updates, products CRUD, offers CRUD, customers list/detail) work without an authenticated admin principal while this temporary mode is enabled.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "remove authemtication for now from amdin",
          "build it now now"
        ]
      },
      "acceptanceCriteria": [
        "Calls to existing admin-only backend methods (e.g., `getAllOrders`, `updateOrderStatus`, `createProduct`, `updateProduct`, `deleteProduct`, `getAllOffers`, `createOffer`, `updateOffer`, `activateOffer`, `deactivateOffer`, `deleteOffer`, `getAllCustomers`, `getCustomer`) succeed for an unauthenticated/anonymous caller while the temporary no-auth mode is enabled.",
        "Customer-facing endpoints (e.g., browsing products, placing orders) continue to function as before.",
        "No data migration is required for this change (state remains compatible)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional services).",
    "Do not modify any frontend files under `frontend/src/components/ui` or the immutable hook/bootstrap paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing a permanent admin authentication redesign or role-management UI.",
    "Adding the previously-mentioned customer profile section / unique ID flow (not requested in the latest instruction to build).",
    "Adding third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}