{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Temporary no-auth mode for admin portal (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Bypass the AdminGuard authentication/admin-status checks so all /admin/* routes are reachable without Internet Identity while temporary no-auth mode is enabled.",
      "acceptanceCriteria": [
        "Navigating to `/admin` in a fresh browser session (no Internet Identity login) renders the Admin portal layout and dashboard pages instead of redirecting to `/admin/login`.",
        "Admin routes under `/admin/*` remain reachable without an identity present (e.g., `/admin/products`, `/admin/offers`, `/admin/customers`, `/admin/notifications`).",
        "No UI state is blocked by AdminGuard loading/redirect states when identity is absent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/adminNoAuth.ts",
          "operation": "create",
          "description": "Add a single source of truth for the temporary no-auth mode flag (e.g., derived from a Vite environment variable) so admin auth gating can be toggled without invasive changes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin-check query helper (useIsCallerAdmin) to support being disabled in temporary no-auth mode (e.g., optional parameter to turn off fetching) so AdminGuard doesn’t enter loading/redirect states when identity is absent."
        },
        {
          "path": "frontend/src/admin/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "When temporary no-auth mode is enabled, bypass identity checks, bypass admin-status checks, and render children immediately (no redirect to /admin/login and no loading/redirect UI). When disabled, preserve existing behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Change /admin/login to a no-auth informational page with a direct link/button into /admin while temporary no-auth mode is enabled.",
      "acceptanceCriteria": [
        "Visiting `/admin/login` does not require Internet Identity login in the temporary no-auth mode.",
        "The page displays clear English text indicating admin authentication is temporarily disabled and provides a working action to navigate to `/admin`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "When temporary no-auth mode is enabled, replace the Internet Identity login prompt with a clear message that admin authentication is temporarily disabled and provide a button/link that navigates to /admin; ensure no admin-status check/loading state blocks the page in this mode."
        },
        {
          "path": "frontend/src/test/adminAccessFlow.test.tsx",
          "operation": "modify",
          "description": "Add/adjust a minimal routing-level test to confirm that in temporary no-auth mode, /admin renders the admin layout without redirect and /admin/login shows the disabled-auth message with a working navigation action to /admin."
        }
      ]
    }
  ]
}